codeigniter4/app/Controllers/ClientController.php

    public function dashboard()
    {
        if (!$this->isLoggedIn()) return redirect()->to("/login");
        $client = $this->clientModel->find($this->currentUser["id"]);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1