codeigniter4/app/Controllers/ClientController.php

SELECT *
FROM `clients`
WHERE `telephone` = '0384225292'
 LIMIT 1
---
    public function login()
    {
        if ($this->isLoggedIn()) {
            return redirect()->to('/client/dashboard');
        }

        if ($this->request->getMethod() === 'POST') {
            $telephone = trim($this->request->getPost('telephone'));

            if (empty($telephone)) {
                return redirect()->back()->with('error', 'Veuillez entrer votre numéro de téléphone.');
            }

            $prefixe = substr($telephone, 0, 3);
            $db = \Config\Database::connect();
            $checkPrefix = $db->query("SELECT id FROM prefices WHERE prefixe = ? AND statut = 1", [$prefixe])->getRow();

            if (!$checkPrefix) {
                return redirect()->back()->with('error', 'Numéro invalide. Les préfixes valides sont 033 et 037.');
            }

            $client = $this->clientModel->where('telephone', $telephone)->first();

            if (!$client) {
                $this->clientModel->insert([
                    'telephone' => $telephone,
                    'solde' => 0
                ]);
                $client = $this->clientModel->where('telephone', $telephone)->first();