codeigniter4/app/Controllers/ClientController.php

    public function login()
    {
        if ($this->isLoggedIn()) return redirect()->to("/client/dashboard");
        if ($this->request->getMethod() === "POST") {
            $telephone = trim($this->request->getPost("telephone"));
            if (empty($telephone)) return redirect()->back()->with("error", "Veuillez entrer votre num?ro.");
            $prefixe = substr($telephone, 0, 3);
            $db = \Config\Database::connect();
            $check = $db->query("SELECT id FROM prefices WHERE prefixe = ? AND statut = 1", [$prefixe])->getRow();
            if (!$check) return redirect()->back()->with("error", "Num?ro invalide. Pr?fixes: 033, 037.");
            $client = $this->clientModel->where("telephone", $telephone)->first();
            if (!$client) {
                $this->clientModel->insert(["telephone" => $telephone, "solde" => 0]);
                $client = $this->clientModel->where("telephone", $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0330000000'
 LIMIT 1
INSERT INTO `clients` (`telephone`, `solde`) VALUES ('0330000000', 0)

    public function dashboard()
    {
        if (!$this->isLoggedIn()) return redirect()->to("/login");
        $client = $this->clientModel->find($this->currentUser["id"]);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2

    public function storeDepot()
    {
        if (!$this->isLoggedIn()) return redirect()->to("/login");
        $montant = (float) $this->request->getPost("montant");
        if ($montant <= 0) return redirect()->back()->with("error", "Montant invalide.");
        $db = \Config\Database::connect();
        $db->transStart();
        $this->transactionModel->insert(["id_client" => $this->currentUser["id"], "type_operation" => "depot", "montant" => $montant, "frais" => 0, "montant_total" => $montant]);
        $this->clientModel->update($this->currentUser["id"], ["solde" => $this->currentUser["solde"] + $montant]);
---
INSERT INTO `transactions` (`id_client`, `type_operation`, `montant`, `frais`, `montant_total`) VALUES (2, 'depot', 100, 0, 100)
UPDATE `clients` SET `solde` = 100
WHERE `clients`.`id` IN (2)

    public function historique()
    {
        if (!$this->isLoggedIn()) return redirect()->to("/login");
        $transactions = $this->transactionModel->where("id_client", $this->currentUser["id"])->orderBy("date_creation", "DESC")->findAll();
---
SELECT *
FROM `transactions`
WHERE `id_client` = 2
ORDER BY `date_creation` DESC